#if defined(__AVR__)											//	     ┌───────┐
	#include <avr/pgmspace.h>									//	     │   a   │
#elif defined(RENESAS_CORTEX_M4)								//	┌───┐└───────┘┌───┐
	#include <avr/pgmspace.h>									//	│   │         │   │
	#include <stdint.h>											//	│ f │         │ b │
#else															//	│   │         │   │
	#include <pgmspace.h>										//	│   │         │   │
	#include <stdint.h>											//	└───┘┌───────┐└───┘
#endif															//	     │   g   │
																//	┌───┐└───────┘┌───┐
																//	│   │         │   │
																//	│ e │         │ c │
																//	│   │         │   │
																//	└───┘┌───────┐└───┘  ┌───┐
																//	     │   d   │       │ h │
//	Каждый байт массива содержит биты сегментов hgfedcba		//	     └───────┘       └───┘
const uint8_t arr_CharTo7LED[] PROGMEM =						//
{																//
0x00,															//	[ 0]	' '			Пробел
0x01,															//	[ 1]	'\1'		Сегмент a
0x02,															//	[ 2]	'\2'		Сегмент b
0x04,															//	[ 3]	'\3'		Сегмент c
0x08,															//	[ 4]	'\4' '_'	Сегмент d
0x10,															//	[ 5]	'\5'		Сегмент e
0x20,															//	[ 6]	'\6'		Сегмент f
0x40,															//	[ 7]	'\7' '-'	Сегмент g
0x80,															//	[ 8]	'.'			Сегмент h
0x3F,															//	[ 9]	'0'
0x06,															//	[10]	'1'
0x5B,															//	[11]	'2'
0x4F,															//	[12]	'3'
0x66,															//	[13]	'4'
0x6D,															//	[14]	'5'
0x7D,															//	[15]	'6'
0x07,															//	[16]	'7'
0x7F,															//	[17]	'8'
0x6F,															//	[18]	'9'
0x77,															//	[19]	'A' 'a'
0x7C,															//	[20]	'B' 'b'
0x39,															//	[21]	'C' 'c'
0x5E,															//	[22]	'D' 'd'
0x79,															//	[23]	'E' 'e'
0x71,															//	[24]	'F' 'f'
0x3D,															//	[25]	'G' 'g'
0x74,															//	[26]	'H' 'h'
0x30,															//	[27]	'I' 'i'
0x1E,															//	[28]	'J' 'j'
0x76,															//	[29]	'K' 'k'
0x38,															//	[30]	'L' 'l'
0x76,															//	[31]	'M' 'm'
0x54,															//	[32]	'N' 'n'
0x5C,															//	[33]	'O' 'o'
0x73,															//	[34]	'P' 'p'
0x67,															//	[35]	'Q' 'q'
0x50,															//	[36]	'R' 'r'
0x6D,															//	[37]	'S' 's'
0x78,															//	[38]	'T' 't'
0x3E,															//	[39]	'U' 'u'
0x1C,															//	[40]	'V' 'v'
0x1C,															//	[41]	'W' 'w'
0x76,															//	[42]	'X' 'x'
0x6E,															//	[43]	'Y' 'y'
0x6D,															//	[44]	'Z' 'z'
0x63,															//	[45]	'*'       Сегменты градуса °
};																//	
